wosayttn/M55M1BSP/Library/StdDriver/src/i3c.c
/**************************************************************************//**
 * @file     i3c.c
 * @version  V1.00
 * @brief    I3C driver source file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup I3C_Driver I3C Driver
  @{
*/

/** @addtogroup I3C_EXPORTED_FUNCTIONS I3C Exported Functions
  @{
*/

/**
  * @brief      Open I3C with Static Address and Initial Mode
  *
  * @param[in]  i3c             The pointer of the specified I3C module.
  * @param[in]  u32MasterSlave  Decides the I3C module is operating in master mode or in slave mode. Valid values are:
  *                                 - \ref I3C_SLAVE
  *                                 - \ref I3C_MASTER
  * @param[in]  u8StaticAddr    7-bit slave address for I2C operation.
  * @param[in]  u32ModeSel      Initial mode selection to support ENTDAA CCC or Hot-Join generation. Valid values are:
  *                                 - \ref I3C_SUPPORT_ENTDAA
  *                                 - \ref I3C_SUPPORT_ADAPTIVE_HJ
  *                                 - \ref I3C_SUPPORT_IMMEDIATE_HJ
  *
  * @details    This API is used to configure I3C controller can receive ENTDAA CCC or generate a Hot-Join request.
  *             The 7-bit slave address is used for related I2C operations until I3C controller has a valid Dynamic Address.
  * @note       This API also enables all interrupt status and configures TX, RX FIFO and Response, Command Queue threshold to 0.
  */
void I3C_Open(I3C_T *i3c,
              uint32_t u32MasterSlave,
              uint8_t u8StaticAddr,
              uint32_t u32ModeSel)
{
    /* Disable I3C Controller */
    I3C_Disable(i3c);

    i3c->DEVCTLE = u32MasterSlave; // [0] 0: master, 1: slave

    if (u32MasterSlave == I3C_MASTER)
    {
        // timing setting, offset = 0xb4, 0xb8, 0xbc, 0xc0
        i3c->SCLOD = 0x00050019;
        i3c->SCLPP = 0x00050005;
        //        i3c->SCLFM = 0x01360136;
        i3c->SCLFM = 0x04000400;
        i3c->SCLFMP = 0x0021003f;
        // 0xd4, 0xd8
        i3c->BUSFAT = 0x0000003f;
        i3c->BUSIDLET = 0x00001fff;
        // 0xd0 (New for IBI Test)
        i3c->SDAHOLD = 0x00010000;
        // Threshold setting, 0x1c, 0x20
        i3c->QUETHCTL = 0x00000000;
        i3c->DBTHCTL = 0x00000003; // set rx/tx buffer size
        i3c->DEVADDR = ((u8StaticAddr << I3C_DEVADDR_SA_Pos) | I3C_DEVADDR_SAVALID_Msk)
                       | ((u8StaticAddr << I3C_DEVADDR_DA_Pos) | I3C_DEVADDR_DAVALID_Msk);

        /* Enable all interrupt status */
        i3c->INTSTSEN = 0xFFFFFFFF;

    }
    else
    {
        if (u8StaticAddr == 0)
        {
            i3c->DEVADDR &= ~I3C_DEVADDR_SAVALID_Msk;
        }
        else
        {
            i3c->DEVADDR &= ~I3C_DEVADDR_SA_Msk;
            i3c->DEVADDR |= (I3C_DEVADDR_SAVALID_Msk | u8StaticAddr);
        }

        /* Enable all interrupt status */
        i3c->INTSTSEN = 0xFFFFFFFF;

        /* Set Tx/Rx/CmdQ/ReapQ threshold to 0 */
        i3c->DBTHCTL = 0x0;
        i3c->QUETHCTL = 0x0;

        /* Select the slave ability for enter I3C mode */
        if (u32ModeSel == I3C_SUPPORT_ENTDAA)
        {
            /* HJEN disabled: Slave supports ENTDAA CCC */
            i3c->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
            i3c->SLVEVNTS &= ~I3C_SLVEVNTS_HJEN_Msk;
        }
        else if (u32ModeSel == I3C_SUPPORT_ADAPTIVE_HJ)
        {
            /* Both ADAPTIVE and HJEN enabled: Slave generates a Hot-Join request until receive I3C header 7'h7E on the bus */
            i3c->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
            i3c->SLVEVNTS |= I3C_SLVEVNTS_HJEN_Msk;
        }
        else if (u32ModeSel == I3C_SUPPORT_IMMEDIATE_HJ)
        {
            /* Only HJEN enabled: Slave generates a Hot-Join request immediately */
            i3c->DEVCTL &= ~I3C_DEVCTL_ADAPTIVE_Msk;
            i3c->SLVEVNTS |= I3C_SLVEVNTS_HJEN_Msk;
        }
        else
        {
            /* HJEN disabled: Slave supports ENTDAA CCC */
            i3c->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
            i3c->SLVEVNTS &= ~I3C_SLVEVNTS_HJEN_Msk;
        }
    }

    /* Enable I3C Controller */
    I3C_Enable(i3c);
}

/**
  * @brief      Reset and Resume I3C Controller
  *
  * @param[in]  i3c             The pointer of the specified I3C module.
  * @param[in]  u32ResetMask    Software reset operation of I3C module. Valid values are:
  *                                 - \ref I3C_RESET_CMD_QUEUE
  *                                 - \ref I3C_RESET_RESP_QUEUE
  *                                 - \ref I3C_RESET_TX_BUF
  *                                 - \ref I3C_RESET_RX_BUF
  *                                 - \ref I3C_RESET_ALL_QUEUE_AND_BUF
  * @param[in]  u32EnableResume Enable resume I3C Slave controller. Valid values are TRUE and FALSE.
  *
  * @retval     I3C_STS_NO_ERR      No error
  * @retval     I3C_TIMEOUT_ERR     Function time-out
  *
  * @details    This API is used to reset specified FIFO and Queue or resume the I3C Slave controller from the halt state.
  * @note       THe application can reset Queues and FIFO only when the Slave controller is disabled or
  *             when the Slave controller is in Halt state(I3C_CCCDEVS[9] SLVBUSY = 1) after any error occurred from the I3C Master request.
  */
int32_t I3C_ResetAndResume(I3C_T *i3c, uint32_t u32ResetMask, uint32_t u32EnableResume)
{
    uint8_t u8InHaltState = 0;
    volatile uint32_t u32Timeout;

    if (I3C_IS_SLAVE_BUSY(i3c))
    {
        u8InHaltState = 1;
    }

    if (u32ResetMask)
    {
        /* Reset specify source */
        i3c->RSTCTL = u32ResetMask;
        u32Timeout = (SystemCoreClock / 1000);

        while ((i3c->RSTCTL != 0) && (--u32Timeout)) {}

        if (u32Timeout == 0)
        {
            return I3C_TIMEOUT_ERR;
        }
    }

    if (u32EnableResume || u8InHaltState)
    {
        /* The application has to take necessary action to handle the error condition and
            then set RESUME bit to resume the controller. */
        /* Slave will receive GETSTATUS CCC to clear specify status in I3C_CCCDEVS register. */
        i3c->DEVCTL |= I3C_DEVCTL_RESUME_Msk;

